import React from "react";
import ReadMore from "./../ReadMore/ReadMore";
import {
  Container,
  Wrapper,
  ImageContainer,
  Image,
  TextContainer,
  VideoContainer,
  Video,
} from "./LeftPost-sty;es";
import { sevenYearAnniversaryImage } from "../../Data/Images";
import { videoInDVB } from "../../Data/Materials";

const LeftPosts = () => {
  return (
    <Container>
      <Wrapper>
        <ImageContainer>
          <Image src={sevenYearAnniversaryImage} />
        </ImageContainer>
        <TextContainer>
          <ReadMore>
            လဝန်းရောင်ခြည်၏ (၇)နှစ်ပြည့် သက္ကလပ်ရတုစာချွန်လွှာ
            ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ (၁)
            လဝန်းရောင်ခြည်ပရဟိတလူငယ်အဖွဲ့ကို ၂.၂.၂၀၁၅ ခုနှစ်တွင်
            လူငယ်များစုပေါင်းကာစတင်တည်ထောင်ခဲ့ပြီး ၂.၂.၂၀၂၂ ခုနှစ်တွင် ၇
            နှစ်ကာလသို့ရောက်ရှိခဲ့ပြီလည်းဖြစ်ပါသည်။ထိုနှစ်များအတွင်း
            အများပြည်သူတို့၏ဒုက္ခဆင်းရဲများကိုအဖွဲ့ဝင်ညီငယ်၊ညီမငယ်များမှမျှဝေခံစား၊ဖေးမကူညီ၊အချင်းချင်းရိုင်းပင်းကာစည်းလုံးညီညွတ်စွာဖြတ်သန်းလာခဲ့ကြခြင်းဖြစ်ပါသည်။
            (၂)
            ထိုသို့အများပြည်သူများကိုအထိရောက်ဆုံးပုံစံဖြင့်ကူညီနိုင်ခဲ့ရခြင်းများမှာ
            လစဉ်အလှူရှင်များ၊ပြည်တွင်း၊ပြည်ပမှသီးခြားအလှူရှင်များ၊နှစ်အဆက်ဆက်အမှုဆောင်အဖွဲ့တာဝန်ယူခဲ့ကြသူများ
            နှင့် Volunteerညီအကိုမောင်နှမများ၏ရိုင်းပင်းကူညီလိုတဲ့မေတ္တာတရား
            တို့ဖြင့်စည်းစည်းလုံးလုံးဆောင်ရွက်ခဲ့ကြသဖြင့် သက္ကလပ်ရတု( ၇)
            နှစ်တိုင်ခဲ့ပြီဖြစ်ပါသည်။ (၃) လဝန်းရောင်ခြည်
            ဆိုတာအများအတွက်မွေးဖွားခဲ့တာဖြစ်လို့ ယခုနှစ်များအတွင်းဖြစ်ပွားခဲ့တဲ့
            ကမ္ဘာကပ်ရောဂါကြီးကို အဖွဲ့ဝင်များမှ
            ရဲရဲရင့်ရင့်ရှေ့ဆုံးကရင်ဆိုင်ခဲ့သလို၊ကပ်ဘေးကြီး၏နောက်ဆက်တွဲဆိုးကျိုးတစ်ခုဖြစ်သည့်
            ဆေးဝါးရှာပါးခြင်းဒဏ်၊အစားအစာမလုံလောက်ခြင်းဒဏ်စသည်တို့ကို
            အလှူရှင်တို့၏စေနာသဒ္ဒါတရားနှင့်အဖွဲ့ဝင်များ၏လုပ်အားပေါင်းဖက်ကာအထိရောက်ဆုံးပုံစံဖြင့်လှူဒါန်းနိုင်ခဲ့ပါသည်။
            (၄) ထိုအပြင်
            မြို့သူ၊မြို့သားများအနေနှင့်သတင်းအချက်အလက်များအတိအကျအမှန်ကန်ဆုံးရရှိအောင်
            လဝန်းရောင်ခြည်ပရဟိတလူငယ်အဖွဲ့ လူမှုကွန်ယက်စာမျက်နှာမှ
            ရောဂါကပ်ဘေးသတင်းများ၊မြစ်ရေအခြေအနေများနှင့်အများနှင့်သက်ဆိုင်သောသတင်းအချက်အလက်များကိုပါ
            ယခုနှစ်များအတွင်းတင်ပေးနိုင်ခဲ့ကြပါသည်။ (၅)
            အများကိုကူညီရာမှာလဝန်းရောင်ခြည်ရှေ့ဆုံးကရှိနေသလို
            အလှူရှင်များ၏သဒ္ဒါတရားကြောင့်လည်း နွမ်းပါးအဘိုးအဘွားတွေရှိနေတဲ့
            နေအိမ် ၂ လုံးအား(မေတ္တာအိမ်)ခေါင်စဉ်ဖြင့်
            လဝန်းရောင်ခြည်ကဆောက်လုပ်ပေးနိုင်ခဲ့ပါသည်။အဝတ်အစားမရှိသူအတွက်အဝတ်အစား၊ဆေးဝါးလိုအပ်နေသူကိုဆေးဝါး၊အရေးပေါ်ကုသဖို့လိုနေတဲ့သူတွေကိုလည်း
            ကုသစရိတ်စသည့် စသည့်ဖြင့် လုပ်ဆောင်ပေးနိုင်မှုကို
            ဂုဏ်ယူစွာတင်ပြအပ်ပါသည်။ (၆) နိဂုံးချုပ်အနေဖြင့်
            အဖွဲ့အစည်းအတွင်းလူကိုမူမတည်ပဲစည်းမျဉ်းကိုမူတည်ကာ လဝန်းရောင်ခြည်
            စိတ်ဓာတ်/စည်ကမ်း/ဂရုဏာ ရှေ့တန်းထားကာ
            အလှူရှင်တို့၏လှုဒါန်းပေးမှုတို့ကြောင့်
            လဝန်းရောင်ခြည်ပရဟိတလူငယ်အဖွဲ့ဟာ ရတုများစွာတည်တံ့ခိုင်မြဲစွာ
            လူအများအားကိုးရဆုံးသောအဖွဲ့အစည်းအဖြစ်ရပ်တည်သွားမည်ဖြစ်ပါကြောင်း
            ဓိဌာန်ပြုအပ်ပါသည်။ အမှုဆောင်အဖွဲ့ လဝန်းရောင်ခြည်ပရဟိတလူငယ်အဖွဲ့
            အသင်းအဖွဲ့မှတ်ပုံတင်အမှတ်-၆/မအ/၀၂၃ မြန်အောင်မြို့(၀၉၇၈၄၃၆၂၃၄၃)
          </ReadMore>
        </TextContainer>
      </Wrapper>
      <Wrapper>
        <VideoContainer>
          <Video
            src={videoInDVB}
            scrolling="no"
            frameborder="0"
            allowfullscreen="true"
            allow="autoplay; clipboard-write; encrypted-media; picture-in-picture; web-share"
            allowFullScreen={true}
          ></Video>
        </VideoContainer>
        <ReadMore>
          DVB သတင်းပါ လဝန်းရောင်ခြည်ပရဟိတလူငယ်အဖွဲ့
          ၏ပလတ်စတစ်အမှိူက်နှင့်စားသောက်ကုန်လဲလှယ်ခြင်းအစီအစဥ်
          ================================
        </ReadMore>
      </Wrapper>
    </Container>
  );
};

export default LeftPosts;
