export const messages = [
  {
    id: 1,
    name: "ကိုပြည့်ဖြိုးဇော်",
    rank: "ဥက္ကဌ",
    message:
      "ဘဝဆိုတာရိုးရိုးကျင့်မြင့်မြင့်ကြံပြီးနေထိုင်တတ်ရမယ်ကိုယ်ချင်းစာတရားဆိုတာ သင်တစ်ယောက်တည်းအတွက်မဟုတ်ပါဘူး။ အခြားသူတွေ အပေါ်မှာလည်း ထားသင့်ပါတယ်။",
  },
  {
    id: 2,
    name: "ကိုသော်ဇင်",
    rank: "အဖွဲ့ဝင်",
    message:
      "ပရဟိတဆိုတာပကတိဖြူစင်လွန်းတဲ့နယ်ပယ်တစ်ခုပါ။အရောင်တွေမစွတ်ဖက်၊ပကာသနတွေမရောယှက်၊အတ္တတွေမာနတွေ ရှေ့မထားအဆင့်အတန်းအနိမ့်အမြင့်ခွဲခြားမှူမရှိပဲ၊ပေးဆပ်တတ်သောစိတ်ထားများဖြင့်စိတ်ထားလှသူများ၏အလုပ်မှန်သမျှဟာပရဟိတပါပဲ။",
  },
  {
    id: 3,
    name: "မခင်သီတာဦး",
    rank: "အဖွဲ့ဝင်",
    message:
      "(ပရဟိတဆိုတာ) ပေးဖို့သက်သက်ပါ။ လှူတဲ့အခါ သီလရှိသူတွေကိုရွေးချယ်ကြတာက ကိုယ့်အတွက်ငဲ့လို့ပါ။ ပရဟိတကျတော့ အယုတ် အလတ် အမြတ်မရွေး လူမျိးဘာသာမရွေး ဘယ်သူဘယ်ဝါမရွေး အားလုံးရဲ့အကျိုးအတွက်ပါ။ ",
  },
  {
    id: 4,
    name: "မခိုင်နှင်းဝေ",
    rank: "အဖွဲ့ဝင်",
    message:
      " ပရဟိတစိတ်ဓာတ်ဆိုတာ ဘုရားအလောင်းစိတ်ဓာတ်ပါ။ ခုယူရင် ခုရတဲ့    နိဗ္ဗာန်ချမ်းသာကိုစွန့်ပြီး လေးအသင်္ချေနဲ့ကမ္ဘာတစ်သိန်းကာလပတ်လုံး ပါရမီတော်တွေကို အပင်ပန်းခံအဆင်းရဲခံပြီးဖြည့်ကျင့်ခဲ့တာဟာ သတ္တဝါတွေရဲ့ အကျိုးစီးပွားကိုလိုလားတဲ့  ပရဟိတစိတ်ဓာတ်ကြောင့်ပါ။ ",
  },
];
